In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = pd.read_csv("/home/yadhu/MEGA/ML TUTORIALS/BASICS/CATEGORICAL VALUES/sample.csv")

In [3]:
dataset.head()

     name  gender  mark
0  adarsh    male    50
1   henry    male    45
2     joe    male    42
3     adi    male    35
4    ammu  female    48

In [4]:
dataset.isna().sum()

name      0
gender    0
mark      0
dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
label = le.fit_transform(dataset['gender'])
label

array([1, 1, 1, 1, 0, 0, 0, 0])

In [8]:
dataset.drop('gender',axis=1,inplace=True)
dataset['gender'] = label
dataset

     name  mark  gender
0  adarsh    50       1
1   henry    45       1
2     joe    42       1
3     adi    35       1
4    ammu    48       0
5    devi    50       0
6    sita    24       0
7  anjana    19       0